Tekla Open API Reference for Tekla Structures 2025
Operation.CreateMISFileFromSelected Method
 Creates MIS files from the selected parts using the given file name.
See Tekla Structures Help for more information about MIS files.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool CreateMISFileFromSelected(
	Operation.MISExportTypeEnum MISType,
	string FileName
)
Public Shared Function CreateMISFileFromSelected (
	MISType As Operation.MISExportTypeEnum,
	FileName As String
) As Boolean
Parameters
MISType
Type: Tekla.Structures.Model.Operations.Operation.MISExportTypeEnum
The type of the MIS export.
FileName
Type: System.String
The name of the MIS file to be used in creation.
Return Value
Type: Boolean
True if the MIS files are created, false if the numbering is not up-to-date or the used configuration is wrong.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when the FileName is null.
ArgumentException | Thrown when the FileName is not defined.
Examples
using Tekla.Structures.Model;
using Tekla.Structures.Model.Operations;
using Tekla.Structures.Model.UI;
using System.Collections;
using System.Windows.Forms;
public class Example
{
       public void Example1()
       {
           Picker Picker = new Picker();
           try
           {
               Beam Beam1 = Picker.PickObject(Picker.PickObjectEnum.PICK_ONE_PART, "Pick object to Create MIS for") as Beam;
               ArrayList Parts = new ArrayList();
               Parts.Add(Beam1);
               Tekla.Structures.Model.UI.ModelObjectSelector MOS = new Tekla.Structures.Model.UI.ModelObjectSelector();
               MOS.Select(Parts);
               if (Operation.CreateMISFileFromSelected(Operation.MISExportTypeEnum.STEEL2000, "myExport.st2000"))
                   MessageBox.Show("MIS creation successful");
               MOS.Select(new ArrayList()); //remove UI selection
           }
           catch { }
       }
}
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace